chipKIT32/chipKIT-core/pic32/cores/pic32/HardwareSerial.cpp
/* ------------------------------------------------------------ */
/***	HardwareSerial::write
**
**	Parameters:
**		theChar		- the character to transmit
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Wait until the transmitter is idle, and then transmit the
**		specified character.
*/

size_t HardwareSerial::write(uint8_t theChar)
{

	while ((uart->uxSta.reg & (1 << _UARTSTA_UTXBF)) != 0)	//check the UTXBF bit
  {
		//* wait for the transmitter buffer to have room
	}

	uart->uxTx.reg = theChar;
    return 1;
}

// Hardware serial is always connected regardless.
HardwareSerial::operator int() {
    return 1;
}

/* ------------------------------------------------------------ */
/***	HardwareSerial::doSerialInt
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		This function is called by the interrupt service routine
**		for the UART being used by this object. It's purpose is
**		to process receive interrupts and place the received
**		characters into the receive buffer.
*/

void HardwareSerial::doSerialInt(void)
{
	int		bufIndex;
	uint8_t	ch;

	/* If it's a receive interrupt, get the character and store
	** it in the receive buffer.
	*/
	if ((ifs->reg & bit_rx) != 0)
	{
		ch = uart->uxRx.reg;
        if (rxIntr != NULL) {
            /* If we have had an interrupt callback routine defined then call
            ** that instead of adding the character to the queue. Pass the
            ** received character to the function for processing.
            */
            rxIntr(ch);
        } else {
            bufIndex	= (rx_buffer.head + 1) % RX_BUFFER_SIZE;
        
            /* If we should be storing the received character into the location
            ** just before the tail (meaning that the head would advance to the
            ** current location of the tail), we're about to overflow the buffer
            ** and so we don't write the character or advance the head.
            */
            if (bufIndex != rx_buffer.tail)
            {
                rx_buffer.buffer[rx_buffer.head] = ch;
                rx_buffer.head = bufIndex;
            }
        }

		/* Clear the interrupt flag.
		*/
		ifs->clr = bit_rx;
	}

	/* If it's a transmit interrupt, ignore it, as we don't current
	** have interrupt driven i/o on the transmit side.
	*/
	if ((ifs->reg & bit_tx) != 0)
	{
		/* Clear the interrupt flag.
		*/
		ifs->clr = bit_tx;
	}

}

/* Attach the interrupt by storing a function pointer in the rxIntr variable */
void HardwareSerial::attachInterrupt(void (*callback)(int)) {
    rxIntr = callback;
}

/* Detatching the interrupt is as simple as setting the rxIntr to null. */
void HardwareSerial::detachInterrupt() {
    rxIntr = NULL;
}

/* Sets the bit in the UART status register that enables address detection */
void HardwareSerial::enableAddressDetection(void) {
    uart->uxSta.set = 1 << _UARTSTA_ADDEN;
}

/* Clears the bit in the UART status register that enables address detection */
void HardwareSerial::disableAddressDetection(void) {
    uart->uxSta.clr = 1 << _UARTSTA_ADDEN;
}

/* ------------------------------------------------------------ */
/*				USBSerial Object Class Implementation			*/
/* ------------------------------------------------------------ */


//*******************************************************************************************

#if defined(_USB)

USBSerial::USBSerial(void)
{
	_port = 0;
}
USBSerial::USBSerial(int port)
{
	_port = port;
}

USBSerial::operator int() {
	return Harmony_Cdc_IsPortActive(_port);
}

#ifdef _DEBUG_USB_VIA_SERIAL0_
	#define	DebugViaSerial0(x)	Serial0.println(x)
#else
	#define	DebugViaSerial0(x)
#endif

//*******************************************************************************************
void USBSerial::begin(unsigned long baudRate)
{
#ifdef PIN_LED_TX
    pinMode(PIN_LED_TX, OUTPUT);
    digitalWrite(PIN_LED_TX, LOW);
    createTask(TXLedSwitchOff, 10, TASK_ENABLE, NULL);
#endif

#ifdef PIN_LED_RX
    pinMode(PIN_LED_RX, OUTPUT);
    digitalWrite(PIN_LED_RX, LOW);
    createTask(RXLedSwitchOff, 10, TASK_ENABLE, NULL);
#endif
}


//*******************************************************************************************
void USBSerial::end()
{
}

//*******************************************************************************************

unsigned long USBSerial::getBaudRate() 
{
	USB_CDC_LINE_CODING *line_coding = Harmony_Cdc_GetLineEncoding(_port);
	if (line_coding == NULL) return 9600;
	return line_coding->dwDTERate;
}

//*******************************************************************************************
int USBSerial::available(void)
{
	return Harmony_Cdc_CanRead(_port);
}

//*******************************************************************************************
int USBSerial::peek()
{
	return Harmony_Cdc_PeekChar(_port);
}

//*******************************************************************************************
int USBSerial::read(void)
{
	return Harmony_Cdc_ReadChar(_port);
}

//*******************************************************************************************
void USBSerial::flush()
{
	Harmony_Cdc_Flush(_port);
}

//*******************************************************************************************
size_t USBSerial::write(uint8_t theChar)
{
	unsigned char	usbBuf[4];
	usbBuf[0]	=	theChar;
	return write(usbBuf, 1);
}

//*******************************************************************************************
size_t USBSerial::write(const uint8_t *buffer, size_t size)
{
	size_t totalBytesWritten = 0;
	size_t bytesWritten = 0;
	size_t zeroWrites = 0;
	CDC_STATUS status;
    TXOn();
	while ((size - totalBytesWritten) > 0 && Harmony_Cdc_IsPortActive(_port))
	{
		status = Harmony_Cdc_Write(_port, &buffer[totalBytesWritten], size, &bytesWritten);
		if (bytesWritten == 0)
		{
			if (zeroWrites++ > USB_CDC_INACTIVE_TIMEOUT_MS)
			{
				Harmony_Cdc_SetPortActive(_port, false);
				return totalBytesWritten;
			}

			delay(1);
		}
		else
		{
			totalBytesWritten += bytesWritten;
			zeroWrites = 0;
		}
	}

    TXOff();
	return totalBytesWritten;
}

